{
  "CSE444": [
    "Course Description: CSE 444 is a deep dive into how database management systems (DBMSs) work internally. Students explore the underlying architecture of relational DBMSs, covering query execution, indexing, storage, and transaction management. The course emphasizes building fundamental components of a DBMS from scratch and understanding performance tradeoffs in different data storage and access patterns.",
    "Learning Goals: Understand core components of a database system: storage, indexing, query execution, and transactions.",
    "Learning Goals: Analyze tradeoffs in query execution strategies and storage layout.",
    "Learning Goals: Develop low-level database internals like a query planner, buffer manager, and recovery mechanisms.",
    "Learning Goals: Build real-world DBMS modules from scratch using C++.",
    "Topics: Record and page layout",
    "Topics: Buffer management",
    "Topics: B+ Trees",
    "Topics: Hash indexes",
    "Topics: Join algorithms",
    "Topics: Query planning and optimization",
    "Topics: Concurrency control",
    "Topics: Crash recovery and logging",
    "Tools: C++ for implementing a mini database engine",
    "Tools: Git/GitHub for project collaboration",
    "Tools: Makefiles, Valgrind, and GDB for debugging and testing"
  ],
  "CSE442": [
    "Course Description: CSE 442 explores the theory and practice of data visualization. It emphasizes the creation of effective visual representations that help people explore, understand, and communicate data. The course integrates concepts from graphic design, human perception, and cognitive science with computational techniques. Students apply these principles to build interactive web-based visualizations using modern libraries and frameworks.",
    "Learning Goals: Understand key visualization principles including data encoding, perception, and interaction.",
    "Learning Goals: Learn how to match visualization types to data and tasks (e.g., spatial, temporal, networked).",
    "Learning Goals: Gain fluency with frameworks such as D3.js and Vega-Lite for building visualizations.",
    "Learning Goals: Develop the ability to critique and improve existing visual designs.",
    "Learning Goals: Build full-featured visualization projects and communicate results effectively.",
    "Topics: Graphical perception & cognitive science foundations",
    "Topics: Marks and visual encoding channels",
    "Topics: Scales, axes, legends",
    "Topics: Interaction techniques (brushing, zooming, filtering)",
    "Topics: Geospatial & cartographic visualization",
    "Topics: Multi-view composition",
    "Topics: Deceptive visualization and visual ethics",
    "Topics: Storytelling with data",
    "Tools: Vega-Lite",
    "Tools: D3.js",
    "Tools: Observable Notebooks",
    "Tools: Tableau (introductory tutorial)",
    "Tools: Arquero (data transformation)",
    "Tools: HTML/CSS/JavaScript"
  ],
  "CSE440": [
    "Course Description: CSE 440 introduces students to the process of designing interactive systems through the lens of human-computer interaction (HCI). Rather than focusing on implementation, the course emphasizes a structured design process - from identifying user needs to producing and refining prototypes. Through hands-on projects and critique sessions, students develop skills to ideate, research, prototype, and evaluate interactive digital experiences.",
    "Learning Goals: Apply design research techniques including user interviews and contextual inquiry.",
    "Learning Goals: Develop storyboards, personas, and usage scenarios for prototyping.",
    "Learning Goals: Use low-fidelity and high-fidelity prototypes to explore and refine design ideas.",
    "Learning Goals: Critique peer designs and reflect critically on one-s own process.",
    "Learning Goals: Communicate interaction design decisions through posters, reports, and web summaries.",
    "Topics: Problem framing and design opportunity identification",
    "Topics: Design research and needfinding",
    "Topics: Sketching, storyboarding, and task analysis",
    "Topics: Prototyping techniques (paper and digital)",
    "Topics: Heuristic evaluation and usability testing",
    "Topics: Design critique and reflection",
    "Topics: Final design communication (poster, digital mockup, web post)",
    "Tools: Figma (for high-fidelity design)",
    "Tools: Miro or pen/paper (for low-fidelity prototypes)",
    "Tools: Heuristic evaluation frameworks",
    "Tools: Presentation tools (e.g., Google Slides, InDesign)"
  ]
}